{
  "runId": "mlrh4xft",
  "timestamp": "2026-02-18T03:30:41.986Z",
  "deal": {
    "title": "[WTS] brand new 2026 Rolex 126300 mint green oyster full set $12,300.00 OBO plus shipping",
    "price": 12300,
    "source": "reddit"
  },
  "script": {
    "beats": [
      {
        "id": 1,
        "label": "hook",
        "text": "Stop scrolling right now! I just found the deal of the week and you need to see this. We're talking"
      },
      {
        "id": 2,
        "label": "deal",
        "text": "a Rolex Submariner in excellent condition for just forty-two hundred dollars. That's almost two thousand below market price. The condition"
      },
      {
        "id": 3,
        "label": "value",
        "text": "is excellent, the dial is clean, and this is the real deal. If you're sleeping on this, someone else is"
      },
      {
        "id": 4,
        "label": "cta",
        "text": "buying it. Follow The Hub Deals for more steals like this. Link in bio, go check it out now!"
      }
    ],
    "fullScript": "Stop scrolling right now! I just found the deal of the week and you need to see this. We're talking a Rolex Submariner in excellent condition for just forty-two hundred dollars. That's almost two thousand below market price. The condition is excellent, the dial is clean, and this is the real deal. If you're sleeping on this, someone else is buying it. Follow The Hub Deals for more steals like this. Link in bio, go check it out now!",
    "title": "Custom Script"
  },
  "voice": "Rachel",
  "videoFile": "avatar-reel-2026-02-18T03-30-13.mp4",
  "caption": "🤯 HOLD UP, A 2026 ROLEX ALREADY?! 🤯\n\nThis brand new 126300 Mint Green Oyster is calling your name! 🤩 Full set, ready to ship.\nPriced at $12,300 OBO - don't sleep on this deal! 🤑\nDM us if you're ready to make it yours! ⌚️\n\nFollow @thehubdeals08 for daily deals 🔥\n\n#Rolex #RolexDatejust #126300 #MintGreen #WatchDeals #LuxuryWatches #WatchForSale #Wristwatch #WatchCollector #WatchAddict #WatchFam #Horology #Timepiece #DailyDeals #StealDeal #WatchCommunity #RolexForSale #OysterPerpetual #WatchLover #TheHubDeals08"
}