{
  "runId": "mlrkgi9k",
  "timestamp": "2026-02-18T05:03:42.297Z",
  "deal": {
    "title": "Seiko SKX007 Automatic Dive Watch - Modded",
    "price": 280,
    "source": "ebay"
  },
  "script": {
    "beats": [
      {
        "id": 1,
        "label": "hook",
        "text": "Alright, stop scrolling for a sec! You are NOT gonna believe the deal I just found. This one’s for all my watch lovers out there."
      },
      {
        "id": 2,
        "label": "deal",
        "text": "I just snagged a modded Seiko SKX007 automatic dive watch on eBay for just $280! I know, right? A classic Seiko diver, already upgraded!"
      },
      {
        "id": 3,
        "label": "value",
        "text": "These usually go for way more, especially modded ones. And it's in good condition, so you’re getting a serious bang for your buck on this legendary time piece."
      },
      {
        "id": 4,
        "label": "cta",
        "text": "Make sure you're following @thehubdeals08 for more luxury steals like this. We find the deals so you don't have to. Link in bio for more fire!"
      }
    ],
    "fullScript": "Alright, stop scrolling for a sec! You are NOT gonna believe the deal I just found. This one’s for all my watch lovers out there. I just snagged a modded Seiko SKX007 automatic dive watch on eBay for just $280! I know, right? A classic Seiko diver, already upgraded! These usually go for way more, especially modded ones. And it's in good condition, so you’re getting a serious bang for your buck on this legendary time piece. Make sure you're following @thehubdeals08 for more luxury steals like this. We find the deals so you don't have to. Link in bio for more fire!",
    "title": "Seiko Steal!"
  },
  "voice": "Rachel",
  "videoFile": "avatar-reel-2026-02-18T05-03-15.mp4",
  "caption": "STOP SCROLLING 🚨 Seiko Steal Alert!\n\nWe've got a modded Seiko SKX007 automatic dive watch for ONLY $280! That's right, a legendary Seiko modded and ready to rock. Don't miss out on this incredible value.\n\nThis deal won't last long, so grab it before it's gone!\n\nFollow @thehubdeals08 for daily deals 🔥\n\n#seiko #skx007 #seikomod #divewatch #automaticwatch #watchdeals #watchforsale #watches #watchcollector #wristcandy #watchoftheday #instawatch #watchfam #affordablewatches #watchenthusiast #dailydeals #dealsandsteals #watchaddict #moddedwatch #seikowatch"
}