{
  "runId": "mlrkf6ka",
  "timestamp": "2026-02-18T05:02:44.383Z",
  "deal": {
    "title": "[WTS] Omega Speedmaster 3861 Sapphire Sandwich - Mint - 2023 (under Omega warranty until 2028) - Spiralwinder DON Lumed Ceramic Black Bezel installed ($250) - OEM Bezel Included - Full Kit",
    "price": 250,
    "source": "reddit"
  },
  "script": {
    "beats": [
      {
        "id": 1,
        "label": "hook",
        "text": "Wait, hold up. Are you serious about luxury watches? Because this deal is insane. I'm talking next-level, gotta-see-it-to-believe-it kinda deal."
      },
      {
        "id": 2,
        "label": "deal",
        "text": "Okay, get this: Omega Speedmaster 3861 Sapphire Sandwich, mint condition, from 2023. Full kit, under warranty 'til 2028. And the price? Just two-fifty."
      },
      {
        "id": 3,
        "label": "value",
        "text": "Two-fifty for a Speedmaster? These go for thousands, easily. Plus, it has a Spiralwinder DON Lumed Ceramic Black Bezel installed, that's a $250 value right there, and the original bezel is included. It's practically free!"
      },
      {
        "id": 4,
        "label": "cta",
        "text": "Run, don't walk, this deal won't last. Follow @thehubdeals08 for more steals like this. Link in bio, because we find deals so you don't have to."
      }
    ],
    "fullScript": "Wait, hold up. Are you serious about luxury watches? Because this deal is insane. I'm talking next-level, gotta-see-it-to-believe-it kinda deal. Okay, get this: Omega Speedmaster 3861 Sapphire Sandwich, mint condition, from 2023. Full kit, under warranty 'til 2028. And the price? Just two-fifty. Two-fifty for a Speedmaster? These go for thousands, easily. Plus, it has a Spiralwinder DON Lumed Ceramic Black Bezel installed, that's a $250 value right there, and the original bezel is included. It's practically free! Run, don't walk, this deal won't last. Follow @thehubdeals08 for more steals like this. Link in bio, because we find deals so you don't have to.",
    "title": "Speedmaster Steal!"
  },
  "voice": "Rachel",
  "videoFile": "avatar-reel-2026-02-18T05-02-14.mp4",
  "caption": "STOP SCROLLING! 🚨 Omega Speedmaster for ONLY $250?! 🤯\n\nYeah, you heard that right! Snag this MINT 2023 Sapphire Sandwich with a Spiralwinder bezel AND the original! 🤯\n\nUnder warranty until 2028! Full kit, ready to rock.\n\nDon't miss this crazy deal! Act FAST! 🏃‍♂️💨\n\nFollow @thehubdeals08 for daily deals 🔥\n\n#omegaspeedmaster #speedmaster #speedytuesday #watchdeals #watchforsale #luxurywatches #watchcollector #watchfam #wristporn #horology #watchoftheday #omega #speedmaster3861 #sapphiresandwich #spiralwinder #watchaddict #dealalert #watches #watchesofinstagram #thehubdeals08"
}