{
  "runId": "mlrgkb7i",
  "timestamp": "2026-02-18T03:15:05.377Z",
  "deal": {
    "title": "Seiko SKX007 Automatic Dive Watch - Modded",
    "price": 280,
    "source": "ebay"
  },
  "script": {
    "beats": [
      {
        "id": 1,
        "label": "hook",
        "text": "Alright watch lovers, stop scrolling for a second! I've got a deal that's too good to gatekeep. You are NOT going to believe this price."
      },
      {
        "id": 2,
        "label": "deal",
        "text": "I found a Seiko SKX007, the iconic automatic dive watch, on eBay for just $280. And get this, it's already been modded to look even better!"
      },
      {
        "id": 3,
        "label": "value",
        "text": "These typically go for way more, especially with the mods. The condition is listed as good, so we're talking a killer deal on a timeless classic. This is a serious value proposition."
      },
      {
        "id": 4,
        "label": "cta",
        "text": "Make sure you're following @thehubdeals08 for more insane finds like this one. We find the deals, so you don't have to. Link in bio for the eBay listing!"
      }
    ],
    "fullScript": "Alright watch lovers, stop scrolling for a second! I've got a deal that's too good to gatekeep. You are NOT going to believe this price. I found a Seiko SKX007, the iconic automatic dive watch, on eBay for just $280. And get this, it's already been modded to look even better! These typically go for way more, especially with the mods. The condition is listed as good, so we're talking a killer deal on a timeless classic. This is a serious value proposition. Make sure you're following @thehubdeals08 for more insane finds like this one. We find the deals, so you don't have to. Link in bio for the eBay listing!",
    "title": "Seiko SKX007 Steal!"
  },
  "voice": "Adam",
  "videoFile": "avatar-reel-2026-02-18T03-14-31.mp4",
  "caption": "STOP SCROLLING! This Seiko SKX007 is a STEAL! ...more\n💥 Fully modded and ready to rock.\n⌚ Classic dive watch vibes, upgraded.\n💰 Yours for only $280! Seriously.\n🏃‍♂️💨 Don't miss this chance to snag a legend.\n\nFollow @thehubdeals08 for daily deals 🔥\n\n#seiko #skx007 #seikomod #divewatch #watchdeals #watchforsale #watches #wristcandy #watchfam #instawatch #dailydeals #dealsandsteals #watchenthusiast #watchcollector #affordablewatches #watchoftheday #seikodiver #watchlover #moddedwatch #thehubdeals08"
}