{
  "runId": "mlrgmtar",
  "timestamp": "2026-02-18T03:16:53.446Z",
  "deal": {
    "title": "[WTS] Omega Speedmaster 3861 Sapphire Sandwich - Mint - 2023 (under Omega warranty until 2028) - Spiralwinder DON Lumed Ceramic Black Bezel installed ($250) - OEM Bezel Included - Full Kit",
    "price": 250,
    "source": "reddit"
  },
  "script": {
    "beats": [
      {
        "id": 1,
        "label": "hook",
        "text": "Stop scrolling right now. I just found a deal that's absolutely insane and I need you to see this. We're talking about a Seiko"
      },
      {
        "id": 2,
        "label": "deal",
        "text": "SKX007, the legendary automatic dive watch, for just 280 dollars on Reddit Watchexchange. The condition is excellent and it's already been modded with a"
      },
      {
        "id": 3,
        "label": "value",
        "text": "sapphire crystal. These normally go for 400 to 500 easy. At 280 this is a straight up steal. If you want deals like this"
      },
      {
        "id": 4,
        "label": "cta",
        "text": "hitting your feed every day, make sure you follow The Hub Deals. We find the deals so you don't have to. Link in bio."
      }
    ],
    "fullScript": "Stop scrolling right now. I just found a deal that's absolutely insane and I need you to see this. We're talking about a Seiko SKX007, the legendary automatic dive watch, for just 280 dollars on Reddit Watchexchange. The condition is excellent and it's already been modded with a sapphire crystal. These normally go for 400 to 500 easy. At 280 this is a straight up steal. If you want deals like this hitting your feed every day, make sure you follow The Hub Deals. We find the deals so you don't have to. Link in bio.",
    "title": "Custom Script"
  },
  "voice": "Adam",
  "videoFile": "avatar-reel-2026-02-18T03-16-22.mp4",
  "caption": "🤯 Speedmaster Sapphire Sandwich for ONLY $250?! 🤯\n\nYou read that right! This 2023 Omega Speedmaster 3861 Sapphire Sandwich is practically brand new and under warranty until 2028! 🔥\n\nPLUS, it comes with a $250 Spiralwinder bezel AND the original OEM bezel. Talk about a steal! ⌚\n\nThis is a custom script, so act fast before it's gone! 🏃💨\n\nFollow @thehubdeals08 for daily deals 🔥\n\n#Omega #Speedmaster #SapphireSandwich #WatchDeals #WatchForSale #LuxuryWatches #OmegaSpeedmaster #WatchCollector #WatchesOfInstagram #WristWatch #WatchAddict #Timepiece #DailyDeals #BargainHunter #WatchCommunity #Horology #Spiralwinder #WatchFam #WristCandy #DealsAndSteals"
}